{"library_version": "4.10.2", "change_type": "Bug fixes", "change_id": "LUCENE-5977", "change_description": ": Fix tokenstream safety checks in IndexWriter to properly\nwork across multi-valued fields. Previously some cases across multi-valued\nfields would happily create a corrupt index.", "change_title": "IW should safeguard against token streams returning invalid offsets for multi-valued fields", "detail_type": "Bug", "detail_affect_versions": "4.9,4.9.1,4.10,4.10.1", "detail_fix_versions": "4.10.2,5.0,6.0", "detail_description": "We have a custom token stream that emits information about offsets of each token. My (wrong) assumption was that for multi-valued fields a token stream's offset information is magically shifted, much like this is the case with positions. It's not the case – offsets should be increasing and monotonic across all instances of a field, even if it has custom token streams. So, something like this: where the token function is defined as: will result in either a cryptic assertion thrown from IW: or nothing (or a codec error) if run without assertions. Obviously returning non-shifted offsets from subsequent token streams makes little sense but I wonder if it could be made more explicit (or asserted) that offsets need to be increasing between multiple-values. The minimum is to add some documentation to OffsetAttribute. I don't know if offsets should be shifted automatically, as it's the case with positions – this would change the semantics of existing tokenizers and filters which implement such shifting internally already.", "patch_link": "https://issues.apache.org/jira/secure/attachment/12671778/LUCENE-5977.patch", "patch_content": "none"}
{"library_version": "4.10.2", "change_type": "Bug fixes", "change_id": "LUCENE-6019", "change_description": ": Detect when DocValuesType illegally changes for the\nsame field name.  Also added -Dtests.asserts=true|false so we can\nrun tests with and without assertions. (Simon Willnauer, Robert\nMuir, Mike McCandless).", "change_title": "IndexWriter allows to add same field with different docvlaues type", "detail_type": "Bug", "detail_affect_versions": "4.10.1", "detail_fix_versions": "4.10.2,5.0,6.0", "detail_description": "IndexWriter checks if the DV types are consitent in multiple places but if due to some problems in Elasticsearch users where able to add the same field with different DV types causing merges to fail. Yet I was able to reduce this to a lucene testcase but I was puzzled since it always failed. Yet, I had to run it without assertions and that cause the bug to happen. I can add field foo with BINARY and SORTED_SET causing a merge to fail. Here is a gist https://gist.github.com/s1monw/8707f924b76ba40ee5f3 / https://github.com/elasticsearch/elasticsearch/issues/8009 While this is certainly a problem in Elasticsearch Lucene also allows to corrupt an index due to user error which I think should be prevented. NOTE: this only fails if you run without assertions which I think lucene should do in CI once in a while too.", "patch_link": "https://issues.apache.org/jira/secure/attachment/12676451/LUCENE-6019.patch", "patch_content": "none"}
