{"library_version": "6.4.1", "change_type": "Build", "change_id": "LUCENE-7651", "change_description": ": Fix Javadocs build for Java 8u121 by injecting \"Google Code\nPrettify\" without adding Javascript to Javadocs's -bottom parameter.\nAlso update Prettify to latest version to fix Google Chrome issue.", "change_title": "Javadocs build fails with Java 8 update 121", "detail_type": "Bug", "detail_affect_versions": "6.4", "detail_fix_versions": "6.4.1,6.5,7.0", "detail_description": "Oracle released the recent Java 8 security update (u121). The Jenkins builds fail with the following error while building the Javadocs: This is caused by the Javascript added to pretty-print code examples. We load this in the page footer \"<bottom>\" parameter. Surely, it will be posisble to simply add the mentioned argument, but this will break builds with earlier Java 8 versions. This is nowhere documented, I haven't seen any documentation about this flag nowhere, so I assume this is a bug in Java. They can't change or add command line parameters in minor updates of Java 8. I will ask on the OpenJDK mailing lists if this is a bug (maybe accidentally backported from Java 9).", "patch_link": "https://issues.apache.org/jira/secure/attachment/12848774/LUCENE-7651.patch", "patch_content": "none"}
{"library_version": "6.4.1", "change_type": "Bug Fixes", "change_id": "LUCENE-7657", "change_description": ": Fixed potential memory leak in the case that a (Span)TermQuery\nwith a TermContext is cached.", "change_title": "Queries that reference a TermContext can cause a memory leak when they are cached", "detail_type": "Bug", "detail_affect_versions": "None", "detail_fix_versions": "5.5.4,6.4.1,6.5,7.0", "detail_description": "The TermContext class has a reference to the top reader context of the IndexReader that was used to build it. So if you build a (Span)TermQuery that references a TermContext and this query gets cached, then it will keep holding a reference to the index reader, even after the latter gets closed.", "patch_link": "https://issues.apache.org/jira/secure/attachment/12849090/LUCENE-7657.patch", "patch_content": "none"}
{"library_version": "6.4.1", "change_type": "Bug Fixes", "change_id": "LUCENE-7647", "change_description": ": Made stored fields reclaim native memory more aggressively when\nconfigured with BEST_COMPRESSION. This could otherwise result in out-of-memory\nissues.", "change_title": "CompressingStoredFieldsFormat should reclaim memory more aggressively", "detail_type": "Bug", "detail_affect_versions": "None", "detail_fix_versions": "5.5.4,6.4.1,6.5,7.0", "detail_description": "When stored fields are configured with BEST_COMPRESSION, we rely on garbage collection to reclaim Deflater/Inflater instances. However these classes use little JVM memory but may use significant native memory, so if may happen that the OS runs out of native memory before the JVM collects these unreachable Deflater/Inflater instances. We should look into reclaiming native memory more aggressively.", "patch_link": "https://issues.apache.org/jira/secure/attachment/12848559/LUCENE-7647.patch", "patch_content": "none"}
{"library_version": "6.4.1", "change_type": "Bug Fixes", "change_id": "LUCENE-7670", "change_description": ": AnalyzingInfixSuggester should not immediately open an\nIndexWriter over an already-built index.", "change_title": "AnalyzingInfixSuggester should not immediately open an IndexWriter over an already-built index", "detail_type": "Bug", "detail_affect_versions": "6.4", "detail_fix_versions": "6.4.1,6.5,7.0", "detail_description": "In tests I'm working on under SOLR-6246, I can see that attempts to open an AnalyzingInfixSuggester over a previously-built index fail, because the old suggester's IndexWriter lock is never released.  The issue is that an IndexWriter is created in order to create a SearcherManager over the previously built index.  But this is not necessary: SearcherManager has a ctor that takes a directory instead of an IndexWriter.", "patch_link": "https://issues.apache.org/jira/secure/attachment/12850153/LUCENE-7670.patch", "patch_content": "none"}
