{"library_version": "9.4.2", "change_type": "Bug Fixes", "change_id": "GITHUB#11939", "change_description": ": Fix incorrect cost calculation in DocIdSetBuilder after upgradeToBitSet when doc list is growing.\nThis addresses a bug where the cost of TermRangeQuery/TermInSetQuery and some other queries will be highly underestimated.", "change_title": "none", "detail_type": "none", "detail_affect_versions": "none", "detail_fix_versions": "none", "detail_description": "When we execute TermRangeQuery or TermInSet query, lucene use DocIdSetBuilder to store doc id list. When the doc id list becomes large, it will convert from array to bitset in upgradeToBitSet. When new doc id is added, the counter variable of DocIdSetBuilder is unchanged, and the cost is incorrect in DocIdSetBuilder.build. How to reproduce: it is wrong cost=1026, the actual cost should be 100000. This will cause some performance unexpected issue like lead selection in bool query.", "patch_link": "none", "patch_content": "none"}
{"library_version": "9.4.2", "change_type": "Improvements", "change_id": "GITHUB#11912", "change_description": ",", "change_title": "none", "detail_type": "none", "detail_affect_versions": "none", "detail_fix_versions": "none", "detail_description": "For #11905 bug, as an example, the user may get a generic exception \"Seek Past EOF\". Can we improve it to include the bogus position? For example, If you can see that offset is negative, it is faster to debug. I think the new MMapDir already has some improvements here. Better error messages would help not just people debugging real world problems, but also developers making new stuff and debugging tests. cc: @uschindler The text was updated successfully, but these errors were encountered:", "patch_link": "none", "patch_content": "none"}
{"library_version": "9.4.2", "change_type": "Improvements", "change_id": "GITHUB#11918", "change_description": ",", "change_title": "none", "detail_type": "none", "detail_affect_versions": "none", "detail_fix_versions": "none", "detail_description": "This also adds incorrect (e.g., negative) positions to exception message. This also fixes some wrong exception messages (seek vs. read) in ByteBufferIndexInput. Sometimes it said \"seek\" although it should say \"read\". In MemorySegmentIndexInput I already fixed this last year. This closes #11912 .", "patch_link": "none", "patch_content": "none"}
{"library_version": "9.4.2", "change_type": "Improvements", "change_id": "GITHUB#11905", "change_description": ",", "change_title": "none", "detail_type": "none", "detail_affect_versions": "none", "detail_fix_versions": "none", "detail_description": "This bug has been around since 9.1. It relates directly to the number of nodes that are contained in the level 0 of the HNSW graph. Since level 0 contains all the nodes, this implies the following: The stack trace would indicate an EOF failure as Lucene attempts to seek to a negative number in ByteBufferIndexInput . This commit fixes the type casting and utilizes Math.exact... in the number multiplication and addition. The overhead here is minimal as these calculations are done in constructors and then used repeatably afterwards. I put fixes in the older codecs, I don't know if that is typically done, but if somebody has a large segment and wants to read the vectors, they could build this jar and read them now (the bug is only on read and data layout is unchanged)", "patch_link": "none", "patch_content": "none"}
{"library_version": "9.4.2", "change_type": "Improvements", "change_id": "GITHUB#11916", "change_description": ": improve checkindex to be more thorough for vectors.", "change_title": "none", "detail_type": "none", "detail_affect_versions": "none", "detail_fix_versions": "none", "detail_description": "Checkindex with vectors should exercise the graph and seek operations. These are exposed via the search interface. There is the option to search EVERY stored vector value as we iterate it, but this seemed excessive. So, only 64 vectors are searched, skipping every N vectors (where N allows around 64 searches to be executed). closes : #11911", "patch_link": "none", "patch_content": "none"}
