{"library_version": "4.10.1", "change_type": "Bug fixes", "change_id": "LUCENE-5934", "change_description": ": Fix backwards compatibility for 4.0 indexes.", "change_title": "4.10 broke backwards compatibility for 4.0 beta & 4.0-release indexes", "detail_type": "Bug", "detail_affect_versions": "4.10", "detail_fix_versions": "4.10.1,5.0,6.0", "detail_description": "As reported by Ian on the user list: Its trying to treat them as 3.x", "patch_link": "https://issues.apache.org/jira/secure/attachment/12667767/LUCENE-5934.patch", "patch_content": "none"}
{"library_version": "4.10.1", "change_type": "Bug fixes", "change_id": "LUCENE-5939", "change_description": ": Regenerate old backcompat indexes to ensure they were built with\nthe exact release", "change_title": "4.10.1 cannot read 4.10 indexes", "detail_type": "Bug", "detail_affect_versions": "None", "detail_fix_versions": "4.10.1,5.0,6.0", "detail_description": "Thank you mike for the smoketester addition. It failed because 4.10.1 was not verifying backwards compatibility against 4.10 However, when i added the indexes (svn copied from branch-4x), the test fails.", "patch_link": "none", "patch_content": "none"}
{"library_version": "4.10.1", "change_type": "Bug fixes", "change_id": "LUCENE-5952", "change_description": ": Improve error messages when version cannot be parsed;\ndon't check for too old or too new major version (it's too low level\nto enforce here); use simple string tokenizer.", "change_title": "Give Version parsing exceptions more descriptive error messages", "detail_type": "Bug", "detail_affect_versions": "4.10", "detail_fix_versions": "4.10.1,5.0,6.0", "detail_description": "As discussed on the dev list, it's spooky how Version.java tries to fully parse the incoming version string ... and then throw exceptions that lack details about what invalid value it received, which file contained the invalid value, etc. It also seems too low level to be checking versions (e.g. is not future proof for when 4.10 is passed a 5.x index by accident), and seems redundant with the codec headers we already have for checking versions? Should we just go back to lenient parsing?", "patch_link": "https://issues.apache.org/jira/secure/attachment/12669953/LUCENE-5952.patch", "patch_content": "none"}
{"library_version": "4.10.1", "change_type": "Bug fixes", "change_id": "LUCENE-5958", "change_description": ": Don't let exceptions during checkpoint corrupt the index.\nRefactor existing OOM handling too, so you don't need to handle OOM special\nfor every IndexWriter method: instead such disasters will cause IW to close itself\ndefensively.", "change_title": "OOM or exceptions during checkpoint make IndexWriter have a bad day", "detail_type": "Bug", "detail_affect_versions": "None", "detail_fix_versions": "4.10.1,5.0,6.0", "detail_description": "During finishCommit(), we run checkpoint after we wrote the commit to disk, but if things go wrong here (e.g. IOError when IFD deletes a pending file, OOM), then everything will go wrong (we won't even properly incref things, and may end out deleting wrong files if the user calls rollback, leaving a corrupt index).", "patch_link": "https://issues.apache.org/jira/secure/attachment/12670677/LUCENE-5958.patch", "patch_content": "none"}
{"library_version": "4.10.1", "change_type": "Bug fixes", "change_id": "LUCENE-5904", "change_description": ": Fixed a corruption case that can happen when 1)\nIndexWriter is uncleanly shut-down (OS crash, power loss, etc.), 2)\non startup, when a new IndexWriter is created, a virus checker is\nholding some of the previously written but unused files open and\npreventing deletion, 3) IndexWriter writes these files again during\nthe course of indexing, then the files can later be deleted, causing\ncorruption.  This case was detected by adding evilness to\nMockDirectoryWrapper to have it simulate a virus checker holding a\nfile open and preventing deletion", "change_title": "Add MDW.enableVirusScanner / fix windows handling bugs", "detail_type": "Bug", "detail_affect_versions": "None", "detail_fix_versions": "4.10.1,5.0,6.0", "detail_description": "IndexWriter has logic to handle the case where it can't delete a file (it puts in a retry list and indexfiledeleter will periodically retry, you can force this retry with deletePendingFiles). But from what I can tell, this logic is incomplete, e.g. its not properly handled during CFS creation, so if a file temporarily can't be deleted things like flush will fail.", "patch_link": "https://issues.apache.org/jira/secure/attachment/12665309/LUCENE-5904.patch", "patch_content": "none"}
{"library_version": "4.10.1", "change_type": "Bug fixes", "change_id": "LUCENE-5916", "change_description": ": Static scope test components should be consistent between\ntests (and test iterations). Fix for FaultyIndexInput in particular.", "change_title": "Static scope test components should be consistent between tests (and test iterations)", "detail_type": "Bug", "detail_affect_versions": "None", "detail_fix_versions": "5.0,6.0", "detail_description": "An example of a thing breaking this rule is FaultyIndexInput – its internal 'count' field is incremented at the class level; if a test is reiterated, any counter-based events will happen across the same test's reiterations (instead of being consistent and local to a test).", "patch_link": "https://issues.apache.org/jira/secure/attachment/12665817/LUCENE-5916.patch", "patch_content": "none"}
{"library_version": "4.10.1", "change_type": "Bug fixes", "change_id": "LUCENE-5975", "change_description": ": Fix reading of 3.0-3.3 indexes, where bugs in these old\nindex formats would result in CorruptIndexException \"did not read all\nbytes from file\" when reading the deleted docs file.", "change_title": "Lucene can't read 3.0-3.3 deleted documents", "detail_type": "Bug", "detail_affect_versions": "None", "detail_fix_versions": "4.10.1", "detail_description": "BitVector before Lucene 3.4 had many bugs, particulary that it wrote extra bogus trailing crap at the end. But since Lucene 4.8, we check that we read all the bytes... this check can fail for 3.0-3.3 indexes due to the previous bugs in those indexes, instead users will get exception on open like this: CorruptIndexException(did not read all bytes from file: read 5000 vs 5001....", "patch_link": "https://issues.apache.org/jira/secure/attachment/12670838/LUCENE-5975.patch", "patch_content": "none"}
{"library_version": "4.10.1", "change_type": "Tests", "change_id": "LUCENE-5936", "change_description": ": Add backcompat checks to verify what is tested matches known versions", "change_title": "Add BWC checks to verify what is tested matches what versions we know about", "detail_type": "Test", "detail_affect_versions": "None", "detail_fix_versions": "4.10.1,5.0,6.0", "detail_description": "This is a follow up from LUCENE-5934.  Mike has already has something like this for the smoke tester, but here I am suggesting a test within the test (similar to other Version tests we have which check things like deprecation status of old versions).", "patch_link": "https://issues.apache.org/jira/secure/attachment/12667866/LUCENE-5936.patch", "patch_content": "none"}
