{"library_version": "8.10.1", "change_type": "Bug Fixes", "change_id": "LUCENE-10110", "change_description": ": MultiCollector now handles single leaf collector that wants to skip low-scoring hits\n but the combined score mode doesn't allow it.", "change_title": "MultiCollector should conditionally wrap single leaf collector", "detail_type": "Bug", "detail_affect_versions": "None", "detail_fix_versions": "9.0,8.11,8.10.1", "detail_description": "MultiCollector adapts the score mode of multiple collectors so that they can run together in a search. If a collector wants to skip low-scoring hits, this adapter ensures that the other collectors still see all hits. Although, when all these collectors have early terminated, we allow the skipping collector to start propagating the minimum score. This is not valid because the weight of the query is built from the combined score mode of all collectors at the beginning of the search. So we should always ignore the minimum score in MultiCollector if the combined score mode is different than TOP_SCORES.", "patch_link": "none", "patch_content": "none"}
{"library_version": "8.10.1", "change_type": "Bug Fixes", "change_id": "LUCENE-10119", "change_description": ": Sort optimization with search_after can wrongly skip documents\nwhose values are equal to the last value of the previous page", "change_title": "singleSort should not be set when after is non-null", "detail_type": "Bug", "detail_affect_versions": "9.0,8.10", "detail_fix_versions": "9.0,8.11,8.10.1", "detail_description": "Today we set the parameter `singleSort` to true when we have a single comparator to skip documents whose values equal the last visited value. However, this is incorrect when the search_after parameter is non-null as that we will skip documents whose values are equal, but their docIDs are greater than the docID of the `search_after` parameter.  We found this issue in Elasticsearch after upgrading it to Lucene 8.10 and Lucene 9.", "patch_link": "none", "patch_content": "none"}
{"library_version": "8.10.1", "change_type": "Bug Fixes", "change_id": "LUCENE-10126", "change_description": ": Sort optimization with a chunked bulk scorer\ncan wrongly skip documents", "change_title": "CompetitiveIterator of NumericComparator can wrongly skip documents", "detail_type": "Bug", "detail_affect_versions": "8.9,8.10", "detail_fix_versions": "8.11,8.10.1", "detail_description": "The ML team at Elastic reported that a large scroll with an Elasticsearch nightly build that uses Lucene 9.0 snapshot returns fewer documents than expected. I looked into it and found that the competitive iterator can wrongly skip docs with a chunked bulk scorer.", "patch_link": "none", "patch_content": "none"}
